Anoy vai/Soap UI Work 11-12-2023/XML Files From Teams/get account balance.txt

<soapenv:Envelope xmlns:soapenv="
http://schemas.xmlsoap.org/soap/envelope/"
xmlns:v1="
http://v1.ws.provider.acp.com/">
<soapenv:Header/>
<soapenv:Body>
<v1:getAccountBalance_10>
<!--Optional:-->
<arg0>
<!--Zero or more repetitions:-->
<KeyValues>
<!--Optional:-->
<Key>?</Key>
<!--Optional:-->
<Data>?</Data>
<!--Optional:-->
<Type>?</Type>
</KeyValues>
<!--Optional:-->
<RqUID>?</RqUID>
<AddUsrIdentif>
<!--Zero or more repetitions:-->
<KeyValues>
<!--Optional:-->
<Key>?</Key>
<!--Optional:-->
<Data>?</Data>
<!--Optional:-->
<Type>?</Type>
</KeyValues>
<!--Optional:-->
<UserId>?</UserId>
<!--Optional:-->
<RequestDate>?</RequestDate>
<!--Optional:-->
<UserLanguage>?</UserLanguage>
<!--Optional:-->
<FinancialInstitution>?</FinancialInstitution>
<!--Zero or more repetitions:-->
<Products>?</Products>
<!--Optional:-->
<ProviderLogin>?</ProviderLogin>
<!--Optional:-->
<ProviderPasswd>?</ProviderPasswd>
</AddUsrIdentif>
<!--Optional:-->
<CustomerInformation>
<!--Zero or more repetitions:-->
<KeyValues>
<!--Optional:-->
<Key>?</Key>
<!--Optional:-->
<Data>?</Data>
<!--Optional:-->
<Type>?</Type>
</KeyValues>
<!--Optional:-->
<CustomerId>?</CustomerId>
<!--Optional:-->
<OrgId>?</OrgId>
<!--Optional:-->
<OrgDepth>?</OrgDepth>
<!--Optional:-->
<ContractId>?</ContractId>
</CustomerInformation>
<!--Optional:-->
<AgentInformation>
<!--Zero or more repetitions:-->
<KeyValues>
<!--Optional:-->
<Key>?</Key>
<!--Optional:-->
<Data>?</Data>
<!--Optional:-->
<Type>?</Type>
</KeyValues>
<!--Optional:-->
<OedInstitutionId>?</OedInstitutionId>
<!--Optional:-->
<BranchId>?</BranchId>
<!--Optional:-->
<AgentId>?</AgentId>
</AgentInformation>
<MerchantInformation>
<!--Zero or more repetitions:-->
<KeyValues>
<!--Optional:-->
<Key>?</Key>
<!--Optional:-->
<Data>?</Data>
<!--Optional:-->
<Type>?</Type>
</KeyValues>
<!--Optional:-->
<ChainId>?</ChainId>
<!--Optional:-->
<MerchantId>?</MerchantId>
<!--Optional:-->
<PosId>?</PosId>
</MerchantInformation>
<!--Optional:-->
<CardNumber>?</CardNumber>
</arg0>
</v1:getAccountBalance_10>
</soapenv:Body>
</soapenv:Envelope>